Revit 2024 API
ColorWithTransparency.GetColor Method
 get color
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public Color GetColor()
Visual Basic
Public Function GetColor As Color
Visual C++
public:
Color^ GetColor()
Return Value
 color
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace